app/Controllers/Admin.php

  public function index()
  {
    $data = [
      'admin' => $this->AdminModel->where('id', session()->get('admin_id'))->first(),
      'dataTransaksi' => $this->CustomModel->transaksiTerbaru(),
      'countPemandu' => $this->PemanduModel->countAllResults(),
      'countWisatawan' => $this->WisatawanModel->countAllResults(),
      'countTransaksi' => $this->TransaksiModel->countAllResults()
---
SELECT COUNT(*) AS `numrows`
FROM `pemandu`
SELECT COUNT(*) AS `numrows`
FROM `wisatawan`
SELECT COUNT(*) AS `numrows`
FROM `transaksi`

  public function indexWisatawan()
  {
    $data = [
      'dataWisatawan' => $this->WisatawanModel->findAll(),
      'admin' => $this->AdminModel->where('id', session()->get('admin_id'))->first()
    ];
---
SELECT *
FROM `admin`
WHERE `id` = 'a491cdd6-756d-4073-804e-a1b1768a1f7c'
 LIMIT 1